#### Importing the data and the necessary libraries

In [1]:
import pandas as pd

co2 = pd.read_csv('../source_data/co2_emissions.csv')
industrial = pd.read_csv('../source_data/industrial_production.csv')
gdp = pd.read_csv('../source_data/gdp.csv')

# CO2

#### Choosing relevant columns and renaming

In [2]:
columnsco2 = list(co2.iloc[0])
columnsco2[1] = 'Country'
columnsco2[0] = 'ID'
co2.columns = columnsco2
co2.drop(0, axis=0, inplace=True)
co2.head()

,ID,Country,Year,Series,Value,Footnotes,Source
1,1,"Total, all countries or areas",1975,Emissions (thousand metric tons of carbon diox...,"16,853,532",NaN,Carbon Dioxide Information Analysis Center (CD...
2,1,"Total, all countries or areas",1985,Emissions (thousand metric tons of carbon diox...,"19,864,139",NaN,Carbon Dioxide Information Analysis Center (CD...
3,1,"Total, all countries or areas",1995,Emissions (thousand metric tons of carbon diox...,"23,120,435",NaN,Carbon Dioxide Information Analysis Center (CD...
4,1,"Total, all countries or areas",2005,Emissions (thousand metric tons of carbon diox...,"29,490,014",NaN,Carbon Dioxide Information Analysis Center (CD...
5,1,"Total, all countries or areas",2010,Emissions (thousand metric tons of carbon diox...,"33,472,376",NaN,Carbon Dioxide Information Analysis Center (CD...

In [3]:
print(set(co2['Series']), set(co2['Footnotes']), set(co2['Source']))

(set(['Emissions (thousand metric tons of carbon dioxide)', 'Emissions per capita (metric tons of carbon dioxide)']), set([nan, 'For statistical purposes, the data for China do not include those for the Hong Kong Special Administrative Region (Hong Kong SAR), Macao Special Administrative Region (Macao SAR) and Taiwan Province of China.', 'Including San Marino.', 'Including overseas territories.', 'Including Monaco.']), set(['Carbon Dioxide Information Analysis Center (CDIAC) of the Oak Ridge National Laboratory, Oak Ridge, Tennessee, U.S.A., database on national CO2 emission estimates, last accessed March 2017.']))

In [4]:
co2.drop(['Footnotes'], axis=1, inplace=True)

#### Checking dtypes

In [5]:
co2.head()

,ID,Country,Year,Series,Value,Source
1,1,"Total, all countries or areas",1975,Emissions (thousand metric tons of carbon diox...,"16,853,532",Carbon Dioxide Information Analysis Center (CD...
2,1,"Total, all countries or areas",1985,Emissions (thousand metric tons of carbon diox...,"19,864,139",Carbon Dioxide Information Analysis Center (CD...
3,1,"Total, all countries or areas",1995,Emissions (thousand metric tons of carbon diox...,"23,120,435",Carbon Dioxide Information Analysis Center (CD...
4,1,"Total, all countries or areas",2005,Emissions (thousand metric tons of carbon diox...,"29,490,014",Carbon Dioxide Information Analysis Center (CD...
5,1,"Total, all countries or areas",2010,Emissions (thousand metric tons of carbon diox...,"33,472,376",Carbon Dioxide Information Analysis Center (CD...

In [6]:
co2 = co2.astype({'ID':'int64', 'Year':'int64'})

# The commas in ['Value'] are fucking up the conversion of the type, we will replace them in the separed tables

#### Separing data by series

In [7]:
co2_per_capita = co2[co2['Series']== 'Emissions per capita (metric tons of carbon dioxide)'].drop(['Series'], axis=1)
co2_absolut = co2[co2['Series'] != 'Emissions per capita (metric tons of carbon dioxide)'].drop(['Series'], axis=1)

In [8]:
co2_per_capita.drop(['Source'], axis=1, inplace=True)
co2_absolut.drop(['Source'], axis=1, inplace=True)

#### dtypes for value

In [9]:
co2_absolut['Value'] = co2_absolut['Value'].str.replace(',','')

co2_per_capita = co2_per_capita.astype({'Value':'float64'})
co2_absolut = co2_absolut.astype({'Value':'int64'})

#### joining tables

In [10]:
co2_complete = pd.merge(co2_per_capita, co2_absolut, on=['ID', 'Year', 'Country'], how='left')

In [11]:
co2_complete.columns = ['ID','Country', 'Year','per_capita', 'thousand_tons']

In [12]:
co2_complete.head()

   ID                        Country  Year  per_capita  thousand_tons
0   1  Total, all countries or areas  1975         4.1       16853532
1   1  Total, all countries or areas  1985         4.1       19864139
2   1  Total, all countries or areas  1995         4.0       23120435
3   1  Total, all countries or areas  2005         4.5       29490014
4   1  Total, all countries or areas  2010         4.8       33472376

In [13]:
co2_complete.to_csv('../clean_data/co2_clean.csv')

# GDP

#### Columns

In [14]:
gdp_cols = gdp.iloc[0]
gdp_cols[1] = 'Country'
gdp_cols[0] = 'ID'
gdp.columns = gdp_cols
gdp.drop(0, axis=0, inplace=True)
gdp.head()

,ID,Country,Year,Series,Value,Footnotes,Source
1,1,"Total, all countries or areas",1985,GDP in current prices (millions of US dollars),"13,518,851",NaN,"United Nations Statistics Division, New York, ..."
2,1,"Total, all countries or areas",1995,GDP in current prices (millions of US dollars),"31,084,222",NaN,"United Nations Statistics Division, New York, ..."
3,1,"Total, all countries or areas",2005,GDP in current prices (millions of US dollars),"47,550,129",NaN,"United Nations Statistics Division, New York, ..."
4,1,"Total, all countries or areas",2010,GDP in current prices (millions of US dollars),"66,145,612",NaN,"United Nations Statistics Division, New York, ..."
5,1,"Total, all countries or areas",2015,GDP in current prices (millions of US dollars),"74,757,288",NaN,"United Nations Statistics Division, New York, ..."

In [15]:
print(set(gdp['Series']), 
      set(gdp['Footnotes']), 
      set(gdp['Source']))

(set(['GDP in constant 2010 prices (millions of US dollars)', 'GDP per capita (US dollars)', 'GDP real rates of growth (percent)', 'GDP in current prices (millions of US dollars)']), set([nan, 'Including Kosovo and Metohija.', 'Tanzania mainland only, excluding Zanzibar.', 'For statistical purposes, the data for China do not include those for the Hong Kong Special Administrative Region (Hong Kong SAR), Macao Special Administrative Region (Macao SAR) and Taiwan Province of China.', 'Does not incorporate export of binational hydroelectric power at market prices.', 'Data compiled in accordance with the System of National Accounts 1968 (1968 SNA).', 'Excluding northern Cyprus.', 'Including Western Sahara.', 'Excluding Kosovo and Metohija.', 'Including French Guiana, Guadeloupe, Martinique and R\xe9union.', 'Excludes the temporarily occupied territory of the Autonomous Republic of Crimea and Sevastopol.', 'Does not incorporate value added generated by binational hydroelectric plants.']), set(['United Nations Statistics Division, New York, National Accounts Statistics: Analysis of Main Aggregates (AMA) database, last accessed February 2018.']))

In [16]:
gdp.drop(['Footnotes'], axis=1, inplace=True)
gdp.drop(['Source'], axis=1, inplace=True)

#### dtypes

In [17]:
gdp['Value'] = gdp['Value'].str.replace(',','')
gdp = gdp.astype({'Value':'float64', 'Year':'int64', 'ID':'int64'})

#### separing tables

In [18]:
gdp_growth = gdp[gdp['Series'] == 'GDP real rates of growth (percent)']
gdp_capita = gdp[gdp['Series'] == 'GDP per capita (US dollars)']
gdp_abs = gdp[gdp['Series'] == 'GDP in current prices (millions of US dollars)']

#### join tables

In [19]:
gdp_complete0 = pd.merge(gdp_growth, gdp_capita, on=['ID', 'Year', 'Country'])

In [20]:
gdp_complete = pd.merge(gdp_complete0, gdp_abs, on=['ID', 'Year', 'Country'])

In [21]:
gdp_complete.columns = ['ID','Country', 'Year','abc','Real growth rate','abc1','Per capita', 'abc2','In millions']
gdp_complete.drop('abc', axis=1, inplace=True)
gdp_complete.drop('abc1', axis=1, inplace=True)
gdp_complete.drop('abc2', axis=1, inplace=True)

In [22]:
gdp_complete.head()

,ID,Country,Year,Real growth rate,Per capita,In millions
0,1,"Total, all countries or areas",1985,3.5,2776.0,13518851.0
1,1,"Total, all countries or areas",1995,3.1,5406.0,31084222.0
2,1,"Total, all countries or areas",2005,3.9,7270.0,47550129.0
3,1,"Total, all countries or areas",2010,4.3,9508.0,66145612.0
4,1,"Total, all countries or areas",2015,2.8,10128.0,74757288.0

In [23]:
gdp_complete.to_csv('../clean_data/gdp_clean.csv')

# Industrial production

In [24]:
industrial.head()

,[T25.],Index of Industrial Production,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6
0,Region/Country/Area,NaN,Series,Year,Value,Footnotes,Source
1,8,Albania,Index of industrial production: Total industry...,2007,118.5,NaN,"United Nations Statistics Division, New York, ..."
2,8,Albania,Index of industrial production: Total industry...,2008,142.7,NaN,"United Nations Statistics Division, New York, ..."
3,8,Albania,Index of industrial production: Total industry...,2009,148.3,NaN,"United Nations Statistics Division, New York, ..."
4,8,Albania,Index of industrial production: Total industry...,2010,200.2,NaN,"United Nations Statistics Division, New York, ..."

#### Columns

In [25]:
industrialcols = list(industrial.iloc[0])
industrialcols[1] = 'Country'
industrialcols[0] = 'ID'
industrial.columns = industrialcols
industrial.drop(0, axis=0, inplace=True)
industrial.head()

,ID,Country,Series,Year,Value,Footnotes,Source
1,8,Albania,Index of industrial production: Total industry...,2007,118.5,NaN,"United Nations Statistics Division, New York, ..."
2,8,Albania,Index of industrial production: Total industry...,2008,142.7,NaN,"United Nations Statistics Division, New York, ..."
3,8,Albania,Index of industrial production: Total industry...,2009,148.3,NaN,"United Nations Statistics Division, New York, ..."
4,8,Albania,Index of industrial production: Total industry...,2010,200.2,NaN,"United Nations Statistics Division, New York, ..."
5,8,Albania,Index of industrial production: Total industry...,2011,237.6,NaN,"United Nations Statistics Division, New York, ..."

In [26]:
print(set(industrial['Series']))

set(['Index of industrial production: Metal products and machinery (Index Base: 2005=100)', 'Index of industrial production: Metal products (Index base: 2005=100)', 'Index of industrial production: Water and waste management (Index base: 2005=100)', 'Index of industrial production: Mining (Index base: 2005=100)', 'Index of industrial production: Total industry - Mining; manufacturing; electricity, gas and water (Index base: 2005=100)', 'Index of industrial production: Machinery (Index base: 2005=100)', 'Index of industrial production: Textiles, wearing apparel, leather, footwear (Index base: 2005=100)', 'Index of industrial production: Food, beverages and tobacco (Index base: 2005=100)', 'Index of industrial production: Miscellaneous manufacturing industries (Index base: 2005=100)', 'Index of industrial production: Manufacturing (Index base: 2005=100)', 'Index of industrial production: Electricity, gas and water (Index base: 2005=100)', 'Index of industrial production: Electricity, gas, steam (Index base: 2005=100)', 'Index of industrial production: Chemicals, petroleum, rubber and plastic products (Index base: 2005=100)', 'Index of industrial production: Mining and manufacturing (Index base: 2005=100)', 'Index of industrial production: Basic metals (Index base: 2005=100)'])

In [27]:
print(set(industrial['Footnotes']))

set([nan, 'Twelve months ending 31 March of the year stated.;Including water and waste management.', 'The indices are based on ISIC Rev. 3.;Twelve months beginning 1 July of the year stated.;Data refers to textiles only.', 'Data refers to chemicals and pharmaceutical products only.', 'Excluding petroleum and pharmaceutical products.', 'Twelve months ending 30 June of the year stated.', 'The indices are based on ISIC Rev. 3.;Data refers to fabricated metal products only.', 'The indices are based on ISIC Rev. 3.;Data refers to electricity and water only.', 'Data refers to electricity, steam and air conditioning supply only.', 'The indices are based on ISIC Rev. 3.;Data refers to electricity only.', 'Data refers to food only.', 'The indices are based on ISIC Rev. 3.;Data refers to textiles only.', 'The indices are based on ISIC Rev. 3.;Including basic metals.', 'The indices are based on ISIC Rev. 3.;Twelve months beginning 1 July of the year stated.;Data refers to electricity only.', 'Break in the time series.;Data refers to electricity and gas only.', 'The indices are based on ISIC Rev. 3.;Data refers to food and beverages only.', 'The indices are based on ISIC Rev. 3.;Data refers to fabricated metal products; machinery and equipment, n.e.c.; electrical machinery and apparatus, n.e.c.; and other transport equipment only.', 'The indices are based on ISIC Rev. 3.;Country data supplemented with data from the Observatoire Economique et Statistique d\x92Afrique Subsaharienne (Afristat).;Data refers to manufacturing and utilities only.', 'Twelve months ending 31 March of the year stated.;Excluding repair and installation of machinery and equipment.', 'Break in the time series.', 'For government controlled areas.', 'The indices are based on ISIC Rev. 3.;Excluding wearing apparel.', 'The indices are based on ISIC Rev. 3.;Country data supplemented with data from the Observatoire Economique et Statistique d\x92Afrique Subsaharienne (Afristat).;Data refers to food and beverages only.', 'The indices are based on ISIC Rev. 3.;Twelve months beginning 1 April of the year stated.', 'The indices are based on ISIC Rev. 3.;Data refers to manufacturing and utilities only.', 'The indices are based on ISIC Rev. 3.;Data refers to wearing apparel only.', 'Data refers to fabricated metals, machinery and equipment n.e.c. only.', 'Excludes the Overseas Departments (French Guiana, Guadeloupe, Martinique, Mayotte and R\xe9union).', 'Excluding water and waste management.', 'Twelve months ending 31 March of the year stated.;Including basic metals.', 'Excluding pharmaceutical products.', 'Data refers to electricity and gas only.', 'Data refers to textiles and wearing apparel only.', 'Including other non-metallic mineral products.', 'The indices are based on ISIC Rev. 3.;Data refers to chemicals and chemical products only.', 'The indices are based on ISIC Rev. 3.;Data refers to textiles and wearing apparel only.', 'Data refers to electricity only.', 'The indices are based on ISIC Rev. 3.;Twelve months ending 30 June of the year stated.', 'The indices are based on ISIC Rev. 3.;Country data supplemented with data from the Observatoire Economique et Statistique d\x92Afrique Subsaharienne (Afristat).', 'The indices are based on ISIC Rev. 3.;Country data supplemented with data from the Observatoire Economique et Statistique d\x92Afrique Subsaharienne (Afristat).;Data refers to chemicals and rubber products only.', 'Excluding computer, electronic and optical products; and electrical equipment.', 'The indices are based on ISIC Rev. 3.;Twelve months beginning 1 July of the year stated.', 'The indices are based on ISIC Rev. 3.;Data refers to fabricated metal products; machinery and equipment, n.e.c.; electrical machinery and apparatus, n.e.c.; and radio, television and communication equipment only.', 'The indices are based on ISIC Rev. 3.;Country data supplemented with data from the Observatoire Economique et Statistique d\x92Afrique Subsaharienne (Afristat).;Data refers to fabricated metal products only.', 'The indices are based on ISIC Rev. 3.;Data refers to manufacture of all metal products, machinery and transport equipment only; excluding medical, precision and optical instruments, watches and clocks.', 'For government controlled areas.;Including basic metals.', 'Break in the time series.;Excluding water and waste management.', 'The indices are based on ISIC Rev. 3.;Data refers to machinery and equipment n.e.c.; and manufacturing n.e.c. only.', 'Twelve months ending 31 March of the year stated.', 'Data refers to food and beverages only.', 'The indices are based on ISIC Rev. 3.;Excluding motor vehicles and transport equipment.', 'Excluding transport equipment.', 'Excluding computer, electronic and optical products.', 'The indices are based on ISIC Rev. 3.;Data refers to electricity, gas, steam and hot water supply only.', 'The indices are based on ISIC Rev. 3.;Data refers to fabricated metal products; machinery and equipment, n.e.c.; electrical machinery and apparatus, n.e.c.; and motor vehicles only.', 'The indices are based on ISIC Rev. 3.;Country data supplemented with data from the Observatoire Economique et Statistique d\x92Afrique Subsaharienne (Afristat).;Data refers to textiles and wearing apparel only.', 'Including basic metals.', 'The indices are based on ISIC Rev. 3.;Data refers to electrical machinery and apparatus n.e.c.', 'The indices are based on ISIC Rev. 3.;Country data supplemented with data from the Observatoire Economique et Statistique d\x92Afrique Subsaharienne (Afristat).;Data refers to chemicals and chemical products only.', 'The indices are based on ISIC Rev. 3.;Excluding textiles.', 'Data refers to mining and manufacturing.', 'Twelve months ending 30 June of the year stated.;Data refers to electricity and gas only.', 'The indices are based on ISIC Rev. 3.;Data refers to manufacture of all metal products, machinery and transport equipment only; excluding radio, television and communication apparatus.', 'The indices are based on ISIC Rev. 3.;Twelve months beginning 1 April of the year stated.;Data refers to electricity only.', 'Data refers to fabricated metal products only.', 'The indices are based on ISIC Rev. 3.;Country data supplemented with data from the Observatoire Economique et Statistique d\x92Afrique Subsaharienne (Afristat).;Data refers to electricity and water only.', 'The indices are based on ISIC Rev. 3.;Twelve months ending 30 June of the year stated.;Data refers to electricity only.', 'The indices are based on ISIC Rev. 3.;Excluding petroleum products.', 'The indices are based on ISIC Rev. 3.;Data refers to petroleum products, chemicals and chemical products only.', 'The indices are based on ISIC Rev. 3.', 'The indices are based on ISIC Rev. 3.;Twelve months beginning 1 July of the year stated.;Data refers to chemicals and chemical products only.', 'The indices are based on ISIC Rev. 3.;Data refers to manufacture of all metal products, machinery and transport equipment only; excluding office, accounting and computing machinery machinery.', 'The indices are based on ISIC Rev. 3.;Data refers to fabricated metals, machinery and equipment n.e.c. only.', 'Data refers to wearing apparel only.', 'The indices are based on ISIC Rev. 3.;Country data supplemented with data from the Observatoire Economique et Statistique d\x92Afrique Subsaharienne (Afristat).;Data refers to petroleum products, chemicals and chemical products only.', 'The indices are based on ISIC Rev. 3.;Including manufacturing n.e.c.'])

In [28]:
print(set(industrial['Source']))

set(['United Nations Statistics Division, New York, Environment and energy statistics branch, Industrial and Energy Statistics Section, last accessed November 2015.'])

In [29]:
industrial.drop('Source', axis=1, inplace=True)

In [30]:
industrial.head()

,ID,Country,Series,Year,Value,Footnotes
1,8,Albania,Index of industrial production: Total industry...,2007,118.5,NaN
2,8,Albania,Index of industrial production: Total industry...,2008,142.7,NaN
3,8,Albania,Index of industrial production: Total industry...,2009,148.3,NaN
4,8,Albania,Index of industrial production: Total industry...,2010,200.2,NaN
5,8,Albania,Index of industrial production: Total industry...,2011,237.6,NaN

In [31]:
industrial.to_csv('../clean_data/industrial_clean.csv')

# Creating an ID number for the countries

As we need for every country its pollution and economy in order to correlate them, we need to erase from our datasets the countries that don't belong in both DataFrames.

In [32]:
countries = list(set(gdp_complete['Country']) & set(co2_complete['Country']))

In [33]:
df_countries = pd.DataFrame(zip(range(len(countries)), countries), columns=['IDx','Country'])

In [34]:
df_countries.head()

   IDx                Country
0    0                 Canada
1    1  Sao Tome and Principe
2    2                   Fiji
3    3           Turkmenistan
4    4             Montenegro

In [35]:
gdp_final = pd.merge(gdp_complete, df_countries, how='left', on='Country')
gdp_final.head()

,ID,Country,Year,Real growth rate,Per capita,In millions,IDx
0,1,"Total, all countries or areas",1985,3.5,2776.0,13518851.0,17.0
1,1,"Total, all countries or areas",1995,3.1,5406.0,31084222.0,17.0
2,1,"Total, all countries or areas",2005,3.9,7270.0,47550129.0,17.0
3,1,"Total, all countries or areas",2010,4.3,9508.0,66145612.0,17.0
4,1,"Total, all countries or areas",2015,2.8,10128.0,74757288.0,17.0

In [36]:
co2_final = pd.merge(co2_complete, df_countries, how='left', on='Country')
co2_final.head()

   ID                        Country  Year  per_capita  thousand_tons   IDx
0   1  Total, all countries or areas  1975         4.1       16853532  17.0
1   1  Total, all countries or areas  1985         4.1       19864139  17.0
2   1  Total, all countries or areas  1995         4.0       23120435  17.0
3   1  Total, all countries or areas  2005         4.5       29490014  17.0
4   1  Total, all countries or areas  2010         4.8       33472376  17.0

In [37]:
co2_final.dropna(axis=0, inplace=True)
co2_final.drop(['IDx'], axis=1, inplace=True)
co2_final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1537 entries, 0 to 1650
Data columns (total 5 columns):
ID               1537 non-null int64
Country          1537 non-null object
Year             1537 non-null int64
per_capita       1537 non-null float64
thousand_tons    1537 non-null int64
dtypes: float64(1), int64(3), object(1)
memory usage: 72.0+ KB

In [38]:
gdp_final.dropna(axis=0, inplace=True)
gdp_final.drop(['IDx'], axis=1, inplace=True)
gdp_final.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1391 entries, 0 to 1655
Data columns (total 6 columns):
ID                  1391 non-null int64
Country             1391 non-null object
Year                1391 non-null int64
Real growth rate    1391 non-null float64
Per capita          1391 non-null float64
In millions         1391 non-null float64
dtypes: float64(3), int64(2), object(1)
memory usage: 76.1+ KB

In [39]:
countries_id = pd.DataFrame(gdp_final.groupby('Country').mean()['ID']).reset_index()
countries_id = countries_id.astype({'ID':'int64'})
countries_id

                           Country   ID
0                      Afghanistan    4
1                          Albania    8
2                          Algeria   12
3                          Andorra   20
4                           Angola   24
5                         Anguilla  660
6              Antigua and Barbuda   28
7                        Argentina   32
8                          Armenia   51
9                            Aruba  533
10                       Australia   36
11                         Austria   40
12                      Azerbaijan   31
13                         Bahamas   44
14                         Bahrain   48
15                      Bangladesh   50
16                        Barbados   52
17                         Belarus  112
18                         Belgium   56
19                          Belize   84
20                           Benin  204
21                         Bermuda   60
22                          Bhutan   64
23      Bolivia (Plurin. State of)   68
24          Bosnia and Herzegovina   70
25                        Botswana   72
26                          Brazil   76
27          British Virgin Islands   92
28               Brunei Darussalam   96
29                        Bulgaria  100
..                             ...  ...
175                 Sudan [former]  736
176                       Suriname  740
177                         Sweden  752
178                    Switzerland  756
179           Syrian Arab Republic  760
180                     Tajikistan  762
181                       Thailand  764
182                    Timor-Leste  626
183                           Togo  768
184                          Tonga  776
185  Total, all countries or areas    1
186            Trinidad and Tobago  780
187                        Tunisia  788
188                         Turkey  792
189                   Turkmenistan  795
190       Turks and Caicos Islands  796
191                         Uganda  800
192                        Ukraine  804
193           United Arab Emirates  784
194                 United Kingdom  826
195        United Rep. of Tanzania  834
196       United States of America  840
197                        Uruguay  858
198                     Uzbekistan  860
199                        Vanuatu  548
200     Venezuela (Boliv. Rep. of)  862
201                       Viet Nam  704
202                          Yemen  887
203                         Zambia  894
204                       Zimbabwe  716

[205 rows x 2 columns]

In [40]:
gdp_final.drop('Country', axis=1, inplace=True)
co2_final.drop('Country', axis=1, inplace=True)

In [41]:
gdp_final.to_csv('final_gdp.csv')
co2_final.to_csv('final_co2.csv')
countries_id.to_csv('id_countries.csv')

# Filling a cloud database

In [42]:
from sqlalchemy import create_engine
import pymysql

In [43]:
connection = 'mysql+pymysql://1234:1234@35.242.181.149/project_w5'

In [44]:
engine = create_engine(connection)

In [45]:
gdp_final.to_sql('gdp_final', engine, if_exists='replace')
co2_final.to_sql('co2_final', engine, if_exists='replace')
countries_id.to_sql('countries_id', engine, if_exists='replace')